local M = {}

function M.class(node)
  return {
    icon = '🏛️',
    template = [[
  ┌────────────────┐
  │ CLASS: ${name} │
  ├────────────────┤
  │ ${fields}      │
  ├────────────────┤
  │ ${methods}     │
  └────────────────┘
    ]],
  }
end

function M.module(node)
  return {
    icon = '📦',
    template = [[
  ╔═══════════════╗
  ║ 📦 ${name}    ║
  ║   MODULE      ║
  ╚═══════════════╝
    ]],
  }
end

function M.function_node(node)
  return {
    icon = 'ƒ',
    template = [[
  ┌──────────────┐
  │ ƒ ${name}()  │
  └──────────────┘
    ]],
  }
end

function M.interface(node)
  return {
    icon = '🔌',
    template = [[
  ┌─────────────────┐
  │<<interface>>    │
  │   🔌 ${name}    │
  └─────────────────┘
    ]],
  }
end

return M
