local M = {}

function M.firewall(node)
  return {
    icon = '🔒',
    template = [[
  ┌──────────────┐
  │ 🔒 FIREWALL  │
  │  ${text}     │
  └──────────────┘
    ]],
  }
end

function M.load_balancer(node)
  return {
    icon = '⚖️',
    template = [[
  ┌──────────────────┐
  │ ⚖️ LOAD BALANCER │
  │    ${text}       │
  └──────────────────┘
    ]],
  }
end

function M.router(node)
  return {
    icon = '📡',
    template = [[
  ┌────────────┐
  │ 📡 ROUTER  │
  │  ${text}   │
  └────────────┘
    ]],
  }
end

function M.switch(node)
  return {
    icon = '🔀',
    template = [[
  ┌─────────────┐
  │ 🔀 SWITCH   │
  │  ${text}    │
  └─────────────┘
    ]],
  }
end

return M
